TexasInstruments/mcupsdk-core-k3/examples/drivers/aasrc/aasrc_stereo_playback/am275x-evm/r5fss0-0_freertos/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM275x" --part "AM2754" --package "ANJ" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM2754" --package "FCCSP (ANJ)" --context "r5fss0-0" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.24.0+4150"}
 */

/**
 * Import the modules used in this configuration.
 */
const aasrc      = scripting.addModule("/drivers/aasrc/aasrc", {}, false);
const aasrc1     = aasrc.addInstance();
const i2c        = scripting.addModule("/drivers/i2c/i2c", {}, false);
const i2c1       = i2c.addInstance();
const mcasp      = scripting.addModule("/drivers/mcasp/mcasp", {}, false);
const mcasp1     = mcasp.addInstance();
const debug_log  = scripting.addModule("/kernel/dpl/debug_log");
const mpu_armv7  = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71 = mpu_armv7.addInstance();
const mpu_armv72 = mpu_armv7.addInstance();
const mpu_armv73 = mpu_armv7.addInstance();
const mpu_armv74 = mpu_armv7.addInstance();
const mpu_armv75 = mpu_armv7.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
aasrc1.$name                               = "CONFIG_AASRC0";
aasrc1.aasrcChannel[0].$name               = "CONFIG_AASRC_CH0";
aasrc1.aasrcChannel[0].channelType         = "STEREO";
aasrc1.aasrcChannel[0].txCallbackFxn       = "aasrc_txcb";
aasrc1.aasrcChannel[0].rxCallbackFxn       = "aasrc_rxcb";
aasrc1.aasrcChannel[0].errorCallbackFxn    = "aasrc_ch_error_handler";
aasrc1.aasrcChannel[0].txLoopjobBufLength  = 1024;
aasrc1.aasrcChannel[0].rxLoopjobBufLength  = 512;
aasrc1.aasrcChannel[0].txLoopjobBuf        = "gAasrcTxLoopjobBuf0";
aasrc1.aasrcChannel[0].rxLoopjobBuf        = "gAasrcRxLoopjobBuf0";
aasrc1.aasrcChannel[0].advanced            = true;
aasrc1.aasrcChannel[0].directDownSample    = true;
aasrc1.aasrcReceiveClockZone[0].$name      = "CONFIG_AASRC_CLOCKZONE0";
aasrc1.aasrcReceiveClockZone[0].extClkSrc  = "McASP1_AFSR";
aasrc1.aasrcTransmitClockZone[0].$name     = "CONFIG_AASRC_CLOCKZONE1";
aasrc1.aasrcTransmitClockZone[0].extClkSrc = "McASP1_AFSX";

i2c1.$name           = "CONFIG_I2C0";
i2c1.I2C.$assign     = "I2C0";
i2c1.I2C_child.$name = "drivers_i2c_v0_i2c_v0_template0";

mcasp1.$name                                   = "CONFIG_MCASP0";
mcasp1.enableLoopback                          = false;
mcasp1.clkSyncMode                             = "ASYNC";
mcasp1.txCallbackFxn                           = "mcasp_txcb";
mcasp1.rxCallbackFxn                           = "mcasp_rxcb";
mcasp1.RxMode                                  = "TDM";
mcasp1.rxFsWidth                               = 0;
mcasp1.rxFsPolarity                            = 0;
mcasp1.rxBitClkPolarity                        = 0;
mcasp1.rxActiveSlotMask                        = 0x3;
mcasp1.txActiveSlotMask                        = 0x3;
mcasp1.RxSlotSize                              = 24;
mcasp1.rxDataMask                              = 0xFFFFFF;
mcasp1.TxSlotSize                              = 24;
mcasp1.TxMode                                  = "TDM";
mcasp1.txDataMask                              = 0xFFFFFF00;
mcasp1.rxLoopjobBufLength                      = 2048;
mcasp1.txLoopjobBufLength                      = 4096;
mcasp1.txDataDelay                             = 0;
mcasp1.txDataRotation                          = 6;
mcasp1.afsx                                    = 96;
mcasp1.masterClkx                              = 0;
mcasp1.masterClkr                              = 0;
mcasp1.txHclkDiv                               = 11;
mcasp1.txClkDiv                                = 1;
mcasp1.txHclkCalculated                        = 4468363.636363637;
mcasp1.txBclkCalculated                        = 4468363.636363637;
mcasp1.txFsyncCalculated                       = 93090.9090909091;
mcasp1.rxHclkDiv                               = 3;
mcasp1.rxClkDiv                                = 7;
mcasp1.rxHclkCalculated                        = 16384000;
mcasp1.rxBclkCalculated                        = 2340571.4285714286;
mcasp1.rxFsyncCalculated                       = 48761.90476190476;
mcasp1.txClkApplyAlert                         = false;
mcasp1.rxClkApplyAlert                         = false;
mcasp1.MCASP.$assignAllowConflicts             = "MCASP1";
mcasp1.CLOCKING.$assign                        = "CLOCKING";
mcasp1.mcaspSer.create(2);
mcasp1.mcaspSer[0].$name                       = "CONFIG_MCASP_SER0";
mcasp1.mcaspSer[0].dataDir                     = "Receive";
mcasp1.mcaspSer[0].MCASP.$assignAllowConflicts = "MCASP1";
mcasp1.mcaspSer[1].$name                       = "CONFIG_MCASP_SER1";
mcasp1.mcaspSer[1].serNum                      = 1;
mcasp1.mcaspSer[1].MCASP.$assignAllowConflicts = "MCASP1";
scripting.suppress("Resource conflict,MCASP1 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP1 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.mcaspSer[0].MCASP, "$assign");
scripting.suppress("Resource conflict,MCASP1 is also in use by @@@.+?@@@, @@@.+?@@@", mcasp1.mcaspSer[1].MCASP, "$assign");

const udma         = scripting.addModule("/drivers/udma/udma", {}, false);
const udma1        = udma.addInstance({}, false);
udma1.$name        = "CONFIG_UDMA0";
mcasp1.bcDmaDriver = udma1;
aasrc1.udmaDriver  = udma1;

debug_log.enableUartLog            = true;
debug_log.enableCssLog             = false;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.$assign     = "UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";

mpu_armv71.size         = 31;
mpu_armv71.attributes   = "Device";
mpu_armv71.allowExecute = false;
mpu_armv71.$name        = "REGISTERS";

mpu_armv72.size  = 15;
mpu_armv72.$name = "TCMA";

mpu_armv73.baseAddr = 0x41010000;
mpu_armv73.size     = 15;
mpu_armv73.$name    = "TCMB";

mpu_armv74.size       = 22;
mpu_armv74.baseAddr   = 0x72000000;
mpu_armv74.$name      = "MSRAM_BANK0_TO_BANK3";
mpu_armv74.attributes = "NonCached";

mpu_armv75.baseAddr = 0x72400000;
mpu_armv75.size     = 21;
mpu_armv75.$name    = "MSRAM_BANK4_TO_BANK5";

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
i2c1.I2C.SCL.$suggestSolution                  = "I2C0_SCL";
i2c1.I2C.SDA.$suggestSolution                  = "I2C0_SDA";
mcasp1.MCASP.AFSX.$suggestSolution             = "MCASP1_AFSX";
mcasp1.MCASP.ACLKX.$suggestSolution            = "MCASP1_ACLKX";
mcasp1.MCASP.AFSR.$suggestSolution             = "MCASP0_AXR15";
mcasp1.MCASP.ACLKR.$suggestSolution            = "MCASP0_AXR14";
mcasp1.mcaspSer[0].MCASP.AXR0.$suggestSolution = "MCASP1_AXR0";
mcasp1.mcaspSer[1].MCASP.AXR1.$suggestSolution = "MCASP1_AXR1";
